## Production: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                           |
|--------|----------------------------------------------------------|
| add    | `aws_route53_record.reponses-ai-akamai-domain-ownership` |
|        | `aws_route53_record.reponses-ai-letsencrypt-bootstrap`   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.reponses-ai-akamai-domain-ownership will be created
  + resource "aws_route53_record" "reponses-ai-akamai-domain-ownership" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_akamai-host-challenge.reponses-ia.alpha.canada.ca"
      + records         = [
          + "Eb8m5M4DPFeHSxEovM7af7nlFAwTGiSewgRGFoGFsh5hpevDjoggTg",
        ]
      + ttl             = 60
      + type            = "TXT"
      + zone_id         = "Z05616242JY6JM0CDTYJ6"
    }

  # aws_route53_record.reponses-ai-letsencrypt-bootstrap will be created
  + resource "aws_route53_record" "reponses-ai-letsencrypt-bootstrap" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_acme-challenge.reponses-ia.alpha.canada.ca"
      + records         = [
          + "TATaSipM47YMfTeu-EeE8uI3kMwIM8qOCI9UVFrWqUE",
        ]
      + ttl             = 60
      + type            = "TXT"
      + zone_id         = "Z05616242JY6JM0CDTYJ6"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
